{
  "main": {
    "name":"Cody Chinn",
    "description":"Full Stack Engineer | Innovation Specialist",
    "image":"profilepic.jpg",
    "bio":"As a technology enthusiast I strive to continue learning everything I can about the latest and greatest tech. My curiousity has stretched from Arduino and Raspberry Pi Projects to Mobile App and API development.",
    "contactmessage":"Need a mobile app, website or some innovating ideas? Get in touch!",
    "email": "cdchinn14@gmail.com",
    "phone": "810-623-8711",
    "github":"https://github.com/Cody-Chinn",
    "project":"https://github.com/Cody-Chinn/my-website",
    "address":{
      "street":"",
      "city":"Rockford",
      "state":"MI",
      "zip": "49341"
    },
    "website": "codingcody.me",
    "resumedownload":"./final-resume.docx",
    "social":[
      {
        "name":"facebook",
        "url":"https://www.facebook.com/codychinn15",
        "className":"fa fa-facebook"
      },
      {
        "name":"twitter",
        "url":"https://twitter.com/cody13chinn",
        "className":"fa fa-twitter"
      },
      {
        "name":"linkedin",
        "url":"https://www.linkedin.com/in/cody-chinn/",
        "className":"fa fa-linkedin"
      },
      {
        "name":"instagram",
        "url":"https://www.instagram.com/codychinn_/",
        "className":"fa fa-instagram"
      },
      {
        "name":"github",
        "url":"https://github.com/Cody-Chinn",
        "className":"fa fa-github"
      }
    ]
  },
  "resume":{
    "skillmessage":"Web. Mobile. Innovation.",
    "education":[
      {
        "school":"Grand Valley State University",
        "degree":"BS in Computer Science",
        "graduated":"April 2020",
        "description":"As a student at GVSU I studied a variety of subjects related to object oriented programming. Relevant courses I took include Artificial Intelligence, UX Design, and Web Programming. Highlights from these courses include learning react, competing in a Halite competion, and designing a mobile app using Adobe XD. GVSU gave me a well-rounded programming education so that I could go in any direction with my career."
      },
      {
        "school":"Hartland High School",
        "degree":"Diploma",
        "graduated":"May 2013",
        "description":"During my time in Hartland High School I participated in after school activities to reach out to the community. I was an active member of the Hartland High School Choir where I received my varsity letter for singing in state competitions. Additionally, I helped elementary students in the Big Brothers Big Sisters program where I taught an assigned \"Little\" basic math concepts and reading."
      }
    ],
    "work":[
      {
        "company":"Steelcase",
        "title":"Associate Applications Engineer",
        "years":"April 2019 - Present",
        "description":"After completing my internship during the summer of 2019, Steelcase extended an offer to continue working on their internal websites through the school year. Once graduated, I was offered a position in the Innovation Management Office (IMO) as an Associate Applications Engineer. In this position I'm tasked with investigating new technologies such as the cloud or blockchain and finding ways to leverage my findings in business processes."
      },
      {
        "company":"Challenge Manufacturing",
        "title":"Level 1 HelpDesk Intern",
        "years":"January 2018 - April 2019",
        "description":"As a HelpDesk intern I resolved tickets associated with system management, computer installation, network troubleshooting and software licensing. In addition to resolving tickets I also helped to improve business processes and analytics by coordinating with groups of people from different teams within IT, operations, finance, and engineering."
      },
      {
        "company":"GVSU IT HelpDesk",
        "title":"Level 1 HelpDesk Technician",
        "years":"August 2015 - January 2018",
        "description":"During my time at the GVSU HelpDesk I assisted students and professors on campus with a variety of needs. From network troubleshooting to password resets, the HelpDesk was a great starting point for my career in IT. Since a majority of troubleshooting was done over the phone, I learned to clearly explain solutions to those with varying degrees of technical knowledge."
      }
    ],
    "skills":[
      {
        "name":"React Native",
        "level":"90%"
      },
      {
        "name":"Express",
        "level":"70%"
      },
      {
        "name":"ReactJs",
        "level":"60%"
      },
      {
        "name":"CSS",
        "level":"90%"
      },
      {
        "name":"Java",
        "level":"75%"
      },
      {
        "name":"Kotlin",
        "level":"40%"
      },
      {
        "name":"C",
        "level":"40%"
      }
    ]
  },
  "portfolio":{
    "projects": [
      {
        "title":"Arduino Sarias Song",
        "category":"Small Arduino Project to play Sarias song on loop with lights to match the notes",
        "image":"arduino-thumbnail.png",
        "url":"https://youtu.be/BYI6WHilfx4"
      }
    ]
  }
}
